INITIAL_TERMS = [
  {
    "term": "Микросервис",
    "definition": "Микросервис — это автономный компонент программного обеспечения, который выполняет одну функциональную задачу и взаимодействует с другими компонентами через четко определенные интерфейсы, обычно REST API или сообщение."
  },
  {
    "term": "Архитектурный паттерн",
    "definition": "Концептуальная схема проектирования программного обеспечения, описывающая основные структурные элементы системы и их взаимодействие. Примеры включают монолит, микросервисы и серверлесс."
  },
  {
    "term": "Стратегия развёртывания",
    "definition": "Подход или методика развертывания обновлений приложения, такие как синее/зеленое развёртывание, канареечное развертывание или развертывание с использованием A/B тестирования."
  },
  {
    "term": "Тестовый стенд",
    "definition": "Программно-аппаратная среда, имитирующая рабочие условия для проверки, тестирования или оценки приложения в контролируемых условиях."
  },
  {
    "term": "API",
    "definition": "API (Application Programming Interface) - Интерфейс, который позволяет различным программным компонентам взаимодействовать друг с другом. Он предоставляет набор правил и механизмов для запроса и передачи данных между системами."
  },
  {
    "term": "Контейнеризация",
    "definition": "Технология изоляции приложений и их зависимостей в легковесные контейнеры, которые обеспечивают их выполнение в независимых средах, упрощая переносимость и масштабирование приложений."
  },
  {
    "term": "Оркестрация",
    "definition": "Процесс автоматизации управления контейнерами, включающий их развертывание, масштабирование, сетевую конфигурацию и мониторинг. Основные инструменты для оркестрации — Kubernetes, Docker Swarm."
  },
  {
    "term": "API Gateway",
    "definition": "Промежуточный уровень, который управляет запросами к микросервисам, предоставляя маршрутизацию, балансировку нагрузки, аутентификацию, авторизацию и трансформацию запросов."
  },
  {
    "term": "Service Discovery",
    "definition": "Механизм, позволяющий автоматически находить сетевые адреса микросервисов в системе, упрощая взаимодействие между ними. Обычно реализуется с помощью таких инструментов, как Consul, Eureka или Kubernetes."
  }
]
